from src.main import *


def test_main():
    assert main() == ('08.12.2019 Открытие вклада\n'
                      'Неизвестный -> **5907\n'
                      '41096.24 USD\n'
                      '\n'
                      '07.12.2019 Перевод организации\n'
                      '2842 87** **** 9012 -> **3655\n'
                      '48150.39 USD\n'
                      '\n'
                      '19.11.2019 Перевод организации\n'
                      '7810 84** **** 5568 -> **2869\n'
                      '30153.72 руб.\n'
                      '\n'
                      '13.11.2019 Перевод со счета на счет\n'
                      '3861 14** **** **** 9794 -> **8125\n'
                      '62814.53 руб.\n'
                      '\n'
                      '05.11.2019 Открытие вклада\n'
                      'Неизвестный -> **8381\n'
                      '21344.35 руб.')
